package first;

public class Hello {
    public static void main(String[] args){
        System.out.println("Hello, Java ^^");
    }
}

/*Реализуйте программу, которая бы выводила на экран текст ‘Hello, Java ^^’ */